renesas/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/src/boot_loader_ck_rx65n.c
#if !defined(BSP_CFG_SCI_UART_TERMINAL_ENABLE)
#error "Error! Need to define BSP_CFG_SCI_UART_TERMINAL_ENABLE in r_bsp_config.h"
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (0)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI0()
#define SCI_CH_serial_term          SCI_CH0
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (1)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI1()
#define SCI_CH_serial_term          SCI_CH1
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (2)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI2()
#define SCI_CH_serial_term          SCI_CH2
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (3)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI3()
#define SCI_CH_serial_term          SCI_CH3
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (4)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI4()
#define SCI_CH_serial_term          SCI_CH4
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (5)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI5()
#define SCI_CH_serial_term          SCI_CH5
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (6)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI6()
#define SCI_CH_serial_term          SCI_CH6
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (7)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI7()
#define SCI_CH_serial_term          SCI_CH7
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (8)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI8()
#define SCI_CH_serial_term          SCI_CH8
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (9)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI9()
#define SCI_CH_serial_term          SCI_CH9
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (10)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI10()
#define SCI_CH_serial_term          SCI_CH10
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (11)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI11()
#define SCI_CH_serial_term          SCI_CH11
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (12)
#define R_SCI_PinSet_serial_term()  R_SCI_PinSet_SCI12()
#define SCI_CH_serial_term          SCI_CH12
#else
#error "Error! Invalid setting for BSP_CFG_SCI_UART_TERMINAL_CHANNEL in r_bsp_config.h"
#endif

#define BOOT_LOADER_MAGIC_CODE "Renesas"
#define BOOT_LOADER_MAGIC_CODE_LENGTH 16

typedef struct _load_firmware_control_block {
    uint32_t flash_buffer[FLASH_CF_MEDIUM_BLOCK_SIZE / 4];
    uint32_t offset;
    uint32_t progress;
}LOAD_FIRMWARE_CONTROL_BLOCK;

typedef struct _load_const_data_control_block {
    uint32_t flash_buffer[FLASH_DF_TOTAL_BLOCK_SIZE / 4];
    uint32_t offset;
    uint32_t progress;
}LOAD_CONST_DATA_CONTROL_BLOCK;

typedef struct _sci_buffer_control {
   uint8_t buffer[FLASH_CF_MEDIUM_BLOCK_SIZE];
   uint32_t buffer_occupied_byte_size;
   uint32_t buffer_full_flag;
}SCI_BUFFER_CONTROL;

typedef struct _sci_receive_control_block {
   SCI_BUFFER_CONTROL * p_sci_buffer_control;
   uint32_t total_byte_size;
   uint32_t current_state;
}SCI_RECEIVE_CONTROL_BLOCK;

typedef struct _firmware_update_control_block
{
	uint8_t magic_code[7];
    uint8_t image_flag;
    uint8_t signature_type[32];
    uint32_t signature_size;
    uint8_t signature[256];
    uint32_t dataflash_flag;
    uint32_t dataflash_start_address;
    uint32_t dataflash_end_address;
    uint8_t reserved1[200];
    uint32_t sequence_number;
    uint32_t start_address;
    uint32_t end_address;
    uint32_t execution_address;
    uint32_t hardware_id;
    uint8_t reserved2[236];
}FIRMWARE_UPDATE_CONTROL_BLOCK;

void main(void);
static int32_t secure_boot(void);
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset);
static int32_t const_data_block_read(uint32_t *const_data, uint32_t offset);
static void bank_swap_with_software_reset(void);
static void software_reset(void);
static const uint8_t *get_status_string(uint8_t status);
static void my_sci_callback(void *pArgs);
static void my_flash_callback(void *event);
static void reset_10us_counter(void);
static void start_10us_counter(void);
static void stop_10us_counter(void);
static uint32_t read_10us_counter(void);

extern void my_sw_charget_function(void);
extern void my_sw_charput_function(uint8_t data);
extern void bootloader_software_timer_handler(void *arg);

static FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_bank0 = (FIRMWARE_UPDATE_CONTROL_BLOCK*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS;
static FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_bank1 = (FIRMWARE_UPDATE_CONTROL_BLOCK*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
static LOAD_FIRMWARE_CONTROL_BLOCK load_firmware_control_block;
static LOAD_CONST_DATA_CONTROL_BLOCK load_const_data_control_block;
static uint32_t secure_boot_state = BOOT_LOADER_STATE_INITIALIZING;
static uint32_t flash_error_code;
static uint32_t _10us_counter;
static uint32_t _10us_counter_start_flag;
static uint32_t sha256_time;
static uint32_t ecdsa_time;

/* Handle storage. */
sci_hdl_t     my_sci_handle;
SCI_RECEIVE_CONTROL_BLOCK sci_receive_control_block;
SCI_BUFFER_CONTROL sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_TOTAL_NUM];

R_BSP_ATTRIB_SECTION_CHANGE(C, _BOOT_LOADER_MAGIC_CODE, 1)
const uint8_t boot_loader_magic_code[BOOT_LOADER_MAGIC_CODE_LENGTH] = {BOOT_LOADER_MAGIC_CODE};
R_BSP_ATTRIB_SECTION_CHANGE_END
static const uint8_t *pboot_loader_magic_code = (uint8_t *)BOOT_LOADER_MIRROR_LOW_ADDRESS;

static int32_t firmware_verification_sha256_ecdsa(const uint8_t * pucData, uint32_t ulSize, const uint8_t * pucSignature, uint32_t ulSignatureSize, uint8_t *local_code_signer_public_key);
const uint8_t code_signer_public_key[] = CODE_SIGNER_PUBLIC_KEY_PEM;
const uint32_t code_signer_public_key_length = sizeof(code_signer_public_key);
const uint8_t code_signer_public_key_label[] = "code signer public key";

void main(void)
{
    int32_t result_secure_boot;
    nop();

    while(1)
    {
		result_secure_boot = secure_boot();
		if (BOOT_LOADER_SUCCESS == result_secure_boot)
		{
			/* stop all interrupt completely */
			set_psw(0);
			R_SCI_Close(my_sci_handle);
			uint32_t addr;
			addr = *(uint32_t*)USER_RESET_VECTOR_ADDRESS;
			((void (*)())addr)();
			while(1); /* infinite loop */
		}
		else if (BOOT_LOADER_FAIL == result_secure_boot)
		{
			while(1)
			{
				/* infinity loop */
			}
		}
		else if (BOOT_LOADER_IN_PROGRESS == result_secure_boot)
		{
			continue;
		}
		else
		{
			while(1)
			{
				/* infinite loop */
			}
		}
    }
}

static int32_t secure_boot(void)
{
    flash_err_t flash_api_error_code = FLASH_SUCCESS;
    int32_t secure_boot_error_code = BOOT_LOADER_IN_PROGRESS;
    uint32_t bank_info = 255;
    flash_interrupt_config_t cb_func_info;
	FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_tmp = (FIRMWARE_UPDATE_CONTROL_BLOCK*)load_firmware_control_block.flash_buffer;
	int32_t verification_result = -1;
	uint8_t *local_code_signer_public_key = code_signer_public_key;
	uint32_t local_code_signer_public_key_size = code_signer_public_key_length;

    switch(secure_boot_state)
    {
    	case BOOT_LOADER_STATE_INITIALIZING:
			R_SCI_PinSet_serial_term();

    	    sci_cfg_t   my_sci_config;
    	    sci_err_t   my_sci_err;
    	    uint32_t my_cmt_channel;

